<!-- add-pr-comment:github_plan -->

# production/github Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_iam_policy.notification_manifests_helmfile_diff will be created
  + resource "aws_iam_policy" "notification_manifests_helmfile_diff" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "notification-manifests-helmfile-diff"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "eks:DescribeCluster"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:eks:ca-central-1:296255494825:cluster/notification-canada-ca-*"
                    },
                  + {
                      + Action   = "ec2:ExportClientVpnClientConfiguration"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:ca-central-1:296255494825:client-vpn-endpoint/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }
  # aws_iam_role_policy_attachment.notification_manifests_helmfile_diff will be created
  + resource "aws_iam_role_policy_attachment" "notification_manifests_helmfile_diff" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "notification-manifests-helmfile-diff"
    }
  # aws_iam_role_policy_attachment.notification_manifests_helmfile_diff_oidc_plan_policy will be created
  + resource "aws_iam_role_policy_attachment" "notification_manifests_helmfile_diff_oidc_plan_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::296255494825:policy/OIDCPlanPolicy"
      + role       = "notification-manifests-helmfile-diff"
    }
  # aws_iam_role_policy_attachment.notification_manifests_helmfile_diff_read_only will be created
  + resource "aws_iam_role_policy_attachment" "notification_manifests_helmfile_diff_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + role       = "notification-manifests-helmfile-diff"
    }
  # module.github_workflow_roles_manifests.aws_iam_role.this["notification-manifests-helmfile-diff"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/notification-manifests:ref:refs/heads/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::296255494825:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "notification-manifests-helmfile-diff"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
  # module.github_workflow_roles_manifests.aws_iam_role.this["notification-manifests-staging-smoke-test"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/notification-manifests:ref:refs/heads/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::296255494825:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "notification-manifests-staging-smoke-test"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
Plan: 6 to add, 0 to change, 0 to destroy.

# --- End of Plan 1 ---

```